Revit 2024 API
EquipmentClassification Enumeration
 This enumeration is used to classify the mechanical equipment.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public enum EquipmentClassification
Visual Basic
Public Enumeration EquipmentClassification
Visual C++
public enum class EquipmentClassification
Members
Member name | Description
None |  The undefined equipment type.
Pump |  The pump equipment.
See Also
Autodesk.Revit.DB.Mechanical Namespace